[
    {
        "tabname" : "Introduction",
        "text" : "What color were your toys when you were a child? Let us guess... you're a woman? We bet they were <span class='pink'>pink</span>! A man? Rather <span class='blue'>blue</span> then. We wanted to see if those clichés were still relevant in the gendered toy catalogues in 2020. Take a stroll through our website to discover our findings and establish your own by playing with our interactive visualizations. <br><br> More than a simple analysis of these clichés, we looked more generally at gender disparities among children's toys. We have looked at these disparities from different angles. The angles that we felt were most important were: colour, price and types of toys. By studying toys from these different angles, we had the idea of going a little further by looking at the brands, as well as the dominant colours of the toys according to their price. <br> <br> For this study we have retrieved the toys from the catalogue of La Grande Récré : <a href='https://www.lagranderecre.fr/'>https://www.lagranderecre.fr/</a>. This catalogue is indeed still gendered in spite of the new French legislation in force. The conclusions drawn are therefore characteristic of this catalogue, in spring 2020. <br><br> We have retrieved information about 75269 toys, including image, brand, price, description, dimensions, weight... in order to study them as well as possible.",
        "images" : []
    },{
        "tabname" : "Data",
        "text" : "In order to have a large amount of data we have scrapped the catalogue 'La Grande Récré'.We were thus able to carry out our analyses on 75269 of which 14424 toys were listed in the boys category, 18336 in the girls category and 42509 mixed toys. <br> <br> For each of his toys we recovered the following elements: name, descriptions, price, volume, weight, brand, safety, photos, minimum age, age category and especially the type of the toy. <br> <br> More information" ,
        "images" : [
        ]
    },
    {
        "tabname" : "Color",
        "text" : "Can we observe gender disparities through toy colors? <br> <br> To answer this question, we used python. Our algorithm goes through all the images of the toys in the girl category and then all the images of the toys in the boy category. For each image, we start by reducing its size to limit the execution time, then we convert the rgb values of the image into hsv values so that we can more easily compare the different colors while keeping only the hue. We have also removed the white and black since they can be obtained from any hue value, and these colors would have distorted the results.  Finally, for each image we return a value between 0 and 1 (rounded to the nearest 0.1) which represents the majority hue of the image (excluding white and black). We put all these values in a list and then we count the number of repetitions.  After a few hours of waiting for each genre, we were able to create the bar charts opposite. <br> <br> On these bar charts we can see that pink is indeed a very present colour in girls' toys, it is indeed the most present colour (more than 25% of girls' toys are pink). On the other hand in boys less than one percent of toys are pink. The majority colours in boys' toys are blue, red and orange. It is also noticeable that red and orange are very present in girls' toys. ",
        "images" : [
            "data/img/color_repartition_bar1.png",
            "data/img/color_repartition_bar2.png"
        ]
    },
    {
        "tabname" : "Pink Taxe",
        "text" : "Today many articles talk about the pink tax, like for example this <a href='https://www.bankrate.com/finance/credit-cards/pink-tax-how-women-pay-more/'> article</a>. This article talks about the pink tax in toys and mentions the fact that girls' toys are on average 2 to 13 percent more expensive than boys' toys. We wanted to see if the pink tax was visible in the catalogue 'La Grande Récré'. <br> <br> In order to identify the presence of the pink tax in the catalogue, we observed the price variation of toys according to their volume. You can see the result on the graph below. The abscissa of this graph has been truncated because beyond a certain volume there are too few toys the conclusions drawn would not have been representative of a trend but rather of a few outliers. <br> <br> Second, we looked more generally at the distribution of toys by price according to the type of toy they are associated with. To do this, we went through all the toys one by one and classified them into the corresponding price category. <br> <br> On the first graph it can be seen that above a certain volume boys' toys are considerably more expensive than girls' toys. In the second graph we can see that girls' toys are cheaper than boys' toys. The proportion of girls' toys for the lowest prices is always higher than the proportion of boys' toys. <br> <br> In conclusion, the pink tax is therefore not present in this catalogue!",
        "images" : [
            "data/img/pink_tax_1.png",
            "data/img/pink_tax_2.png"
        ]
    },
    {
        "tabname" : "Words",
        "text" : "Are gender disparities visible through the names of the toys? That's what we've been studying. <br> <br> For this, we went through the names of all the toys, and in these names the words of more than 4 letters to avoid pronouns and other linking words. We are well aware that some words of less than 4 letters are not pronouns or linking words, however this limit seemed coherent to us in view of the results we were able to obtain without it. <br> <br> Here is a list of the 10 most common words in the names of girls' toys and their number of occurrences : <ol> <li> POUPÉE (2012) </li> <li> NEIGES (1228) </li> <li> PRINCESSE (955)</li> <li> DISNEY (857) </li> <li> COROLLE (806) </li> <li> COFFRET (781)</li> <li> PELUCHE (774) </li> <li> PRINCESSES (726) </li> <li> DÉGUISEMENT (655) </li> <li> BARBIE (646)</li> </ol><br> <br> Here is a list of the 10 most common words in the names of boys' toys and their number of occurrences : <ol> <li> PLAYMOBIL (922) </li> <li> FIGURINE (756) </li> <li> VOITURE (749))</li> <li> CAMION (514) </li> <li> COFFRET (506) </li> <li> DEGUISEMENT (395)</li> <li> MODELE (321) </li> <li> NINJAGO (312) </li> <li> AVENGERS (294) </li> <li> RADIOCOMMANDÉE (291)</li> </ol> <br> <br> What we can see is that indeed the toys for girls and boys are not at all the same, we have princesses on one side and cars on the other side. The only two words we have in common are 'déguisement' and 'coffret'. Although the words 'déguisement' and 'coffret' appear more often in the names of girls' toys.  <br> <br> Moreover, we notice that in both girls and boys the presence of brands among the most common words in toy names. In fact, that's what gave us the following study. ",
        "images" : [
            "data/img/description_words.png"
        ]
    },
    {
        "tabname" : "Brands",
        "text" : "Thanks to the study of the most frequent words in toy names we had the idea to study the most present brands according to gender. In order to show the influence of branding on gender disparities.  <br> <br> In this analysis we left all the words, therefore all the brands regardless of the length of the brand name.   However, one must be critical of the results. Indeed, the ranking is established according to the number of times the brand name appears. Here are the brands more present in girls' toys: <ol> <li> COROLLE (1563) </li> <li> MATTEL (969) </li> <li> LEGO (771) </li> <li> HASBRO (748) </li> <li> GIOCHI PREZIOSI (731) </li> <li> TY (669) </li> <li> EPOCH (594) </li> <li> PLAYMOBIL (536) </li> <li> SMOBY  (527) </li> <li> DOUDOU ET COMPAGNIE (426) </li> </ol> And here are the brands more present in boys' toys: <ol> <li> LEGO (2793) </li> <li> PLAYMOBIL (948) </li> <li> HASBRO (727) </li> <li> MATTEL (454) </li> <li> SMOBY (357) </li> <li> BRUDER (334) </li> <li> RUBIE'S (327) </li> <li> JOHN WORLD (316) </li> <li> GIOCHI PREZIOSI (316) </li> <li> LE COIN DES ENFANTS (265) </li> </ol> <br> <br> We can see, for example, that legos have mostly been placed in boys' toys, even if the brand is still very present among girls' toys. On the other hand, some brands are only present in one of the two top 10, it is the case for example of corolle. It is also necessary to consider that this distribution of girls/boys toys is the one made by 'la grande récré'. ",
        "images" : [
            "data/img/marques_words.png",
            "data/img/girl_brands3.png",
            "data/img/boy_brands2.png"
        ]
    },
    {
        "tabname" : "Prices",
        "text" : "Finally, the last question we tried to answer is this: Are the most gendered toys the cheapest ones? <br> <br>For this we have separated the toys into 2 categories: those that cost less than 10 euros, and those that cost more than 50 euros and we have reduced the impact of gender to the color of the toys. So we have observed the majority of hues among these toys. <br> <br> Thus we can observe that among the toys for girls that cost more than 50 euros 33% are pink compared to 25% of pink toys among those that cost less than 10 euros. In boys' toys, we can see that the majority colours are always the same, and with similar proportions. ",
        "images" : [
            "data/img/price_girls_bar1.png",
            "data/img/prices_girls_bar2.png",
            "data/img/price_boys_1.png",
            "data/img/price_boys_2.png"
        ]
    }
]